# -*- org-src-preserve-indentation: t; org-edit-src-content: 0; -*-
#+TITLE: Supplementary I: Result Visualization
#+AUTHOR: Rohit Goswami
#+EMAIL: rog32@hi.is
# This should not be altered
#+OPTIONS: toc:nil title:nil todo:nil
# I need the footnotes to be inlined
#+STARTUP: fninline

*** Fragment analysis
#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
dfff %>%
  # 1. Group the data by both grouping variables
  group_by(num_fragments, method) %>%
  # 2. Calculate the summary statistics for each group
  summarize(
    # Count the number of TRUE values in the success column
    # TRUE values are treated as 1, FALSE as 0, so sum() gives the count.
    success_count = sum(success, na.rm = TRUE),

    # Count the total number of rows (runs) in the group
    total_runs = n(),

    # Calculate the success rate (or proportion)
    success_rate = success_count / total_runs,

    # Count the number of failures (optional)
    failure_count = sum(!success, na.rm = TRUE),

    # To drop the grouping structure afterwards
    .groups = "drop"
  ) -> dfff_frags
dfff_frags
#+end_src

#+RESULTS[6bcc9c442548e29c4e50418326ddc802fd45dd69]:
| num_fragments | method  | success_count | total_runs | success_rate | failure_count |
|---------------+---------+---------------+------------+--------------+---------------|
|             1 | Dimer   |            24 |         26 |          0.9 |             2 |
|             1 | GPDimer |            26 |         26 |            1 |             0 |
|             1 | OTGPD   |            26 |         26 |            1 |             0 |
|             2 | Dimer   |           205 |        212 |          1.0 |             7 |
|             2 | GPDimer |           204 |        212 |          1.0 |             8 |
|             2 | OTGPD   |           207 |        212 |          1.0 |             5 |
|             3 | Dimer   |           174 |        178 |          1.0 |             4 |
|             3 | GPDimer |           172 |        178 |          1.0 |             6 |
|             3 | OTGPD   |           166 |        178 |          0.9 |            12 |
|             4 | Dimer   |            56 |         57 |          1.0 |             1 |
|             4 | GPDimer |            55 |         57 |          1.0 |             2 |
|             4 | OTGPD   |            49 |         57 |          0.9 |             8 |
|             5 | Dimer   |            19 |         20 |          0.9 |             1 |
|             5 | GPDimer |            17 |         20 |          0.8 |             3 |
|             5 | OTGPD   |            19 |         20 |          0.9 |             1 |
|             6 | Dimer   |             2 |          3 |          0.7 |             1 |
|             6 | GPDimer |             2 |          3 |          0.7 |             1 |
|             6 | OTGPD   |             1 |          3 |          0.3 |             2 |
|             7 | Dimer   |             4 |          4 |            1 |             0 |
|             7 | GPDimer |             4 |          4 |            1 |             0 |
|             7 | OTGPD   |             1 |          4 |          0.2 |             3 |


# together with the success rate
Better visualized
# file link :file ../method_success_plot.png
#+begin_src R :results  none
## agg_png("method_success_plot.png", width = 10, height = 8, units = "in", res = 300)
dfff %>%
  ## filter(num_fragments < 6) %>%
  mutate(
    success_status = factor(success, labels = c("Failure", "Success")),
    num_fragments_f = factor(num_fragments)
  ) %>%

  ggplot(aes(x = method, fill = success_status)) +

  # 1. Use position = "fill" to make all bars 100% tall (proportional)
  geom_bar(position = "fill", color = "black") +

  # 2. Add proportional labels inside the bars
  geom_text(
    stat = 'count',
    # Calculate the proportion for the label placement
    aes(label = after_stat(count), y = after_stat(count / tapply(count, x, sum)[as.character(x)])),
    position = position_fill(vjust = 0.5), # Center the labels vertically within the stack
    size = 11
    color = "white"
  ) +

  # 3. Facet by num_fragments
  facet_wrap(
    ~ num_fragments_f,
    ncol = 6,
    labeller = labeller(num_fragments_f = function(x) paste("Fragments =", x))
  ) +

  # 4. Set scales and labels
  scale_y_continuous(labels = scales::percent, name = "Proportion of Runs") +
  scale_fill_manual(
    values = c("Failure" = "#E377C2", "Success" = "#1F77B4")
  ) +
  labs(
    title = expression("Method Success Proportion by Fragment Count"),
    x = "Method",
    fill = "Run Status"
  ) +

  # 5. Theme cleanup for a sleek look
  theme_Publication() +
  theme(
    plot.title = element_text(hjust = 0.5, face = "bold"),
    legend.position = "bottom",
    axis.text.x = element_text(angle = 45, hjust = 1),
    panel.spacing = unit(0.5, "lines")
  )
## dev.off()
#+end_src

**** Basic statistics

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
df %>% filter(success == TRUE) %>%
  group_by(method) %>%
  summarise(median_pes=median(pes_calls),
            mean_pes=mean(pes_calls),
            min_pes=min(pes_calls),
            max_pes=max(pes_calls),
            n=n())
#+end_src

#+RESULTS[62b931bf4ffc25c91e5491775455590525f30320]:
| method | median_pes | mean_pes | min_pes | max_pes |  n |
|--------+------------+----------+---------+---------+----|
| GPDimer   |       30.5 |     32.6 |      20 |      82 | 26 |
| otgp   |         28 |     28.7 |      20 |      45 | 26 |


Along with the total time statistic.

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
df %>% filter(success == TRUE) %>%
  group_by(method) %>%
  summarise(median_time=median(tot_time),
            mean_time=mean(tot_time),
            min_time=min(tot_time),
            max_time=max(tot_time),
            n=n())
#+end_src

#+RESULTS[40154440a245b35cad298405beb06861201cb357]:
| method | median_time | mean_time | min_time | max_time |  n |
|--------+-------------+-----------+----------+----------+----|
| GPDimer   |        10.0 |      25.4 |      2.4 |    347.7 | 26 |
| otgp   |         7.4 |       9.7 |      1.3 |     39.0 | 26 |


Now we can check what happens to the ones which reach the same endpoints..

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
find_matching_saddles(df,
                      'method',
                      'otgp',
                      'GPDimer',
                      0.01) -> same_saddles_rot
same_saddles_rot %>%
  group_by(method) %>%
  summarize(mpes=mean(pes_calls), mtime = mean(tot_time), n=n())
#+end_src

#+RESULTS[9a759e3aa2b513686254b170793288f7ff990cbd]:
| method | mpes | mtime |  n |
|--------+------+-------+----|
| GPDimer   | 27.6 |  12.6 | 19 |
| otgp   | 26.8 |   9.9 | 19 |


Finally we close the visualizations out with some actual visuals.

#+begin_src R :results none
plot_diff_in(df %>% filter(pes_calls < 1500),
             'pes_calls', 'method',
             'GPDimer', 'otgp', 'PES calls', 0.01,
             ## point_color = color("muted", reverse=TRUE)(3),
             ) -> pdiff_idr
plot_linecomp(df, 'pes_calls', 'method', 'otgp', 'GPDimer', 'PES Calls', 0.01) -> plc_pes_idr
plot_linecomp(df, 'tot_time', 'method', 'otgp', 'GPDimer', 'Total time', 0.01) -> plc_time_idr
## Maybe because plot_diff_in doesn't keep the ones which are equal
pdiff_idr + theme_Publication() | (plc_pes_idr / plc_time_idr)
#+end_src

**** GPDimer and OTGPD
#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
# Find system_ids where GPDimer failed
gpd_failures <- dfff %>%
  filter(method == "GPDimer", success == FALSE) %>%
  pull(system_id) %>%
  unique()

# Find system_ids where OTGPD succeeded
otgpd_successes <- dfff %>%
  filter(method == "OTGPD", success == TRUE) %>%
  pull(system_id) %>%
  unique()

# Filter the original dataframe for systems that are in both lists
dfff %>%
  filter(system_id %in% gpd_failures & system_id %in% otgpd_successes) %>%
  select(system_id, method, success, saddle_energy, saddle_fmax)
#+end_src

#+RESULTS[54c172cf8b9617f1f664e9061afd308ccae20517]:
| system_id | method  | success | saddle_energy | saddle_fmax |
|-----------+---------+---------+---------------+-------------|
| d_006     | Dimer   | TRUE    |       -7199.7 |         0.0 |
| d_052     | Dimer   | TRUE    |      -10398.2 |         0.0 |
| d_075     | Dimer   | TRUE    |       -7319.7 |         0.0 |
| d_087     | Dimer   | FALSE   |               |             |
| d_104     | Dimer   | FALSE   |               |             |
| d_110     | Dimer   | TRUE    |       -6317.3 |         0.0 |
| d_150     | Dimer   | TRUE    |      -10398.7 |         0.0 |
| d_160     | Dimer   | TRUE    |       -9313.1 |         0.0 |
| d_193     | Dimer   | TRUE    |       -7405.1 |         0.0 |
| d_199     | Dimer   | TRUE    |       -8461.2 |         0.0 |
| s_065     | Dimer   | TRUE    |       -4219.9 |         0.0 |
| s_074     | Dimer   | TRUE    |       -5276.1 |         0.0 |
| s_082     | Dimer   | TRUE    |       -8389.8 |         0.0 |
| s_137     | Dimer   | TRUE    |       -4220.4 |         0.0 |
| s_207     | Dimer   | TRUE    |       -7334.0 |         0.0 |
| s_256     | Dimer   | TRUE    |       -6331.2 |         0.0 |
| d_006     | GPDimer | FALSE   |               |             |
| d_052     | GPDimer | FALSE   |               |             |
| d_075     | GPDimer | FALSE   |               |             |
| d_087     | GPDimer | FALSE   |               |             |
| d_104     | GPDimer | FALSE   |               |             |
| d_110     | GPDimer | FALSE   |               |             |
| d_150     | GPDimer | FALSE   |               |             |
| d_160     | GPDimer | FALSE   |               |             |
| d_193     | GPDimer | FALSE   |               |             |
| d_199     | GPDimer | FALSE   |               |             |
| s_065     | GPDimer | FALSE   |               |             |
| s_074     | GPDimer | FALSE   |               |             |
| s_082     | GPDimer | FALSE   |               |             |
| s_137     | GPDimer | FALSE   |               |             |
| s_207     | GPDimer | FALSE   |               |             |
| s_256     | GPDimer | FALSE   |               |             |
| d_006     | OTGPD   | TRUE    |       -7199.7 |         0.0 |
| d_052     | OTGPD   | TRUE    |      -10398.2 |         0.0 |
| d_075     | OTGPD   | TRUE    |       -7319.7 |         0.0 |
| d_087     | OTGPD   | TRUE    |       -9341.9 |         0.0 |
| d_104     | OTGPD   | TRUE    |       -7317.2 |         0.0 |
| d_110     | OTGPD   | TRUE    |       -6317.3 |         0.0 |
| d_150     | OTGPD   | TRUE    |      -10398.7 |         0.0 |
| d_160     | OTGPD   | TRUE    |       -9313.1 |         0.0 |
| d_193     | OTGPD   | TRUE    |       -7405.1 |         0.0 |
| d_199     | OTGPD   | TRUE    |       -8461.2 |         0.0 |
| s_065     | OTGPD   | TRUE    |       -4219.9 |         0.0 |
| s_074     | OTGPD   | TRUE    |       -5275.8 |         0.0 |
| s_082     | OTGPD   | TRUE    |       -8389.8 |         0.0 |
| s_137     | OTGPD   | TRUE    |       -4220.4 |         0.0 |
| s_207     | OTGPD   | TRUE    |       -7334.0 |         0.0 |
| s_256     | OTGPD   | TRUE    |       -6330.7 |         0.0 |

**** Only GPDimer/Dimer succeeds

i.e. least coordinated dispalcement (Dimer/GPDimer) compared to the OTGPD with
the XTB initialization.

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
otgpd_failures <- dfff %>%
  filter(method == "OTGPD", success == FALSE) %>%
  pull(system_id) %>%
  unique()

dfff %>%
  filter(!(system_id %in% gpd_failures) & !(system_id %in% otgpd_successes)) %>%
  filter(success == TRUE & num_fragments < 3) %>%
  select(system_id, method, success, saddle_energy, tot_time, pes_calls, rmsd_init_saddle)
#+end_src

#+RESULTS[110151b807ff533ab58dc2c81310b4b0f2312441]:
| system_id | method  | success | saddle_energy | tot_time | pes_calls | rmsd_init_saddle |
|-----------+---------+---------+---------------+----------+-----------+------------------|
| d_016     | Dimer   | TRUE    |       -5261.6 |      7.4 |       106 |              0.3 |
| d_084     | Dimer   | TRUE    |       -8376.4 |    255.4 |      2666 |              8.3 |
| d_100     | Dimer   | TRUE    |      -10371.1 |     24.3 |       214 |              0.2 |
| s_242     | Dimer   | TRUE    |       -3162.9 |     14.6 |       249 |              1.0 |
| d_016     | GPDimer | TRUE    |       -5261.6 |      3.7 |        20 |              0.3 |
| d_084     | GPDimer | TRUE    |       -8376.5 |    417.0 |        75 |              7.3 |
| d_100     | GPDimer | TRUE    |      -10370.0 |     16.2 |        28 |              0.5 |
| s_242     | GPDimer | TRUE    |       -3162.9 |      2.3 |        25 |             13.3 |

**** Only OTGPD suceeds
#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
# Find system_ids where GPDimer failed
gpd_failures <- dfff %>%
  filter(method == "GPDimer", success == FALSE) %>%
  pull(system_id) %>%
  unique()

# Find system_ids where OTGPD succeeded
otgpd_successes <- dfff %>%
  filter(method == "OTGPD", success == TRUE) %>%
  pull(system_id) %>%
  unique()

# Filter the original dataframe for systems that are in both lists
dfff %>%
  filter(system_id %in% gpd_failures & system_id %in% otgpd_successes) %>%
  select(system_id, method, success, saddle_energy, saddle_fmax)
#+end_src

#+RESULTS[54c172cf8b9617f1f664e9061afd308ccae20517]:
| system_id | method  | success | saddle_energy | saddle_fmax |
|-----------+---------+---------+---------------+-------------|
| d_006     | Dimer   | TRUE    |       -7199.7 |         0.0 |
| d_052     | Dimer   | TRUE    |      -10398.2 |         0.0 |
| d_075     | Dimer   | TRUE    |       -7319.7 |         0.0 |
| d_087     | Dimer   | FALSE   |               |             |
| d_104     | Dimer   | FALSE   |               |             |
| d_110     | Dimer   | TRUE    |       -6317.3 |         0.0 |
| d_150     | Dimer   | TRUE    |      -10398.7 |         0.0 |
| d_160     | Dimer   | TRUE    |       -9313.1 |         0.0 |
| d_193     | Dimer   | TRUE    |       -7405.1 |         0.0 |
| d_199     | Dimer   | TRUE    |       -8461.2 |         0.0 |
| s_065     | Dimer   | TRUE    |       -4219.9 |         0.0 |
| s_074     | Dimer   | TRUE    |       -5276.1 |         0.0 |
| s_082     | Dimer   | TRUE    |       -8389.8 |         0.0 |
| s_137     | Dimer   | TRUE    |       -4220.4 |         0.0 |
| s_207     | Dimer   | TRUE    |       -7334.0 |         0.0 |
| s_256     | Dimer   | TRUE    |       -6331.2 |         0.0 |
| d_006     | GPDimer | FALSE   |               |             |
| d_052     | GPDimer | FALSE   |               |             |
| d_075     | GPDimer | FALSE   |               |             |
| d_087     | GPDimer | FALSE   |               |             |
| d_104     | GPDimer | FALSE   |               |             |
| d_110     | GPDimer | FALSE   |               |             |
| d_150     | GPDimer | FALSE   |               |             |
| d_160     | GPDimer | FALSE   |               |             |
| d_193     | GPDimer | FALSE   |               |             |
| d_199     | GPDimer | FALSE   |               |             |
| s_065     | GPDimer | FALSE   |               |             |
| s_074     | GPDimer | FALSE   |               |             |
| s_082     | GPDimer | FALSE   |               |             |
| s_137     | GPDimer | FALSE   |               |             |
| s_207     | GPDimer | FALSE   |               |             |
| s_256     | GPDimer | FALSE   |               |             |
| d_006     | OTGPD   | TRUE    |       -7199.7 |         0.0 |
| d_052     | OTGPD   | TRUE    |      -10398.2 |         0.0 |
| d_075     | OTGPD   | TRUE    |       -7319.7 |         0.0 |
| d_087     | OTGPD   | TRUE    |       -9341.9 |         0.0 |
| d_104     | OTGPD   | TRUE    |       -7317.2 |         0.0 |
| d_110     | OTGPD   | TRUE    |       -6317.3 |         0.0 |
| d_150     | OTGPD   | TRUE    |      -10398.7 |         0.0 |
| d_160     | OTGPD   | TRUE    |       -9313.1 |         0.0 |
| d_193     | OTGPD   | TRUE    |       -7405.1 |         0.0 |
| d_199     | OTGPD   | TRUE    |       -8461.2 |         0.0 |
| s_065     | OTGPD   | TRUE    |       -4219.9 |         0.0 |
| s_074     | OTGPD   | TRUE    |       -5275.8 |         0.0 |
| s_082     | OTGPD   | TRUE    |       -8389.8 |         0.0 |
| s_137     | OTGPD   | TRUE    |       -4220.4 |         0.0 |
| s_207     | OTGPD   | TRUE    |       -7334.0 |         0.0 |
| s_256     | OTGPD   | TRUE    |       -6330.7 |         0.0 |

*** I: Success Probability
Recall that the OTGPD times out after 240 minutes, so anything longer counts as a "failure" for this plot.
#+begin_src R :results drawer replace
agg_png("method_success_plot.png", width = 360, height = 240, units = "mm", res = 300)
plot_df <- dfff %>%
  filter(num_fragments < 3) %>%
  mutate(
    termination_status = if_else(
      .data[["tot_time"]] > 240,
      as.factor("Timeout"),
      .data[["termination_status"]]
    )
  ) %>%
  mutate(
    !!sym("success") := case_when(
      # If termination_status is NA, treat as 0 (Failure)
      is.na(.data[["termination_status"]]) ~ 0,
      # If status is "GOOD", it's 1 (Success)
      .data[["termination_status"]] == "GOOD" ~ 1,
      # All other statuses (e.g., Timeout, Error) are 0 (Failure)
      TRUE ~ 0
    )
  )

# --- Plot 1: OTGPD vs. GPDimer ---
p1 <- plot_success_comp(
  df = plot_df,
  system_id_cols = c("system_id"),
  comparison_col = "method",
  level1 = "GPDimer",
  level2 = "OTGPD",
  level_names = c("GPDimer", "OTGPD"),
  success_col = "success",
  sort_by_col = "rmsd_init_saddle",
  point_colors = c("orange", "red", "grey50", "blue"),
  show_summary_text = FALSE
)

p1$plot <- p1$plot +
  labs(
    x = "System Sorted by Mean RMSD", y = NULL, title = NULL
  ) +
  theme_Publication() +
  theme(
    plot.subtitle = element_blank(),
    panel.grid.major.y = element_line(color = "grey80", linetype = "dashed"),
    panel.grid.major.x = element_line(color = "grey80", linetype = "dashed"),
    legend.position = "none"
  )

# --- Plot 2: OTGPD vs. Dimer ---
p2 <- plot_success_comp(
  df = plot_df,
  system_id_cols = c("system_id"),
  comparison_col = "method",
  level1 = "Dimer",
  level2 = "OTGPD",
  level_names = c("Dimer", "OTGPD"),
  success_col = "success",
  sort_by_col = "rmsd_init_saddle",
  point_colors = c("orange", "red", "grey50", "blue"),
  show_summary_text = FALSE
)
p2$plot <- p2$plot +
  labs(
    x = "System Sorted by Mean RMSD", y = NULL, title = NULL
  ) +
  theme_Publication() +
  theme(
    plot.subtitle = element_blank(),
    panel.grid.major.y = element_line(color = "grey80", linetype = "dashed"),
    panel.grid.major.x = element_line(color = "grey80", linetype = "dashed"),
    legend.position = "none"
  )

p3 <- plot_df %>%
  mutate(
    success_status = factor(success, labels = c("Failure", "Success")),
    num_fragments_f = factor(num_fragments)
  ) %>%
  ggplot(aes(x = method, fill = success_status)) +

  # 1. Use position = "fill" to make all bars 100% tall (proportional)
  geom_bar(position = "fill", color = "black") +

  # 2. Add proportional labels inside the bars
  geom_text(
    stat = "count",
    fontface = "bold",
    ## Calculate the proportion for the label placement
    aes(label = after_stat(count), y = after_stat(count / tapply(count, x, sum)[as.character(x)])),
    ## Center the labels vertically within the stack
    position = position_fill(vjust = 0.5),
    color = "white"
  ) +

  # 3. Facet by num_fragments
  facet_wrap(
    ~num_fragments_f,
    ncol = 6,
    labeller = labeller(num_fragments_f = function(x) paste("Fragments =", x))
  ) +

  # 4. Set scales and labels
  coord_cartesian(ylim = c(0.4, 1.0)) +
  scale_y_continuous(labels = scales::percent) +
  scale_fill_manual(
    values = c("Failure" = "#E377C2", "Success" = "#1F77B4")
  ) +
  labs(
    x = NULL, y = NULL, title = NULL,
    fill = "Run Status"
  ) +

  # 5. Theme cleanup for a sleek look
  theme_Publication() +
  theme(
    plot.title = element_blank(),
    axis.title.y = element_blank(),
    axis.text.y = element_blank(),
    axis.ticks.y = element_blank(),
    axis.title.x = element_blank(),
    legend.position = "right",
    panel.spacing = unit(0.5, "lines")
  )

# --- Combine the plots ---
(((p1$plot | p2$plot) + plot_layout(axis_titles = "collect")) / p3) + plot_layout(heights = c(0.4, 1)) + plot_annotation(
  tag_levels = "A"
)
dev.off()

## Now the caption
summary_df1 <- parse_success_comp_summary(p1$summary_text, "OTGPD_v_GPDimer")
summary_df2 <- parse_success_comp_summary(p2$summary_text, "OTGPD_v_Dimer")

final_table_data <- bind_rows(summary_df1, summary_df2) %>%
  mutate(
    Value = paste0(Count, " (", Pct, ")"),
    Outcome = str_replace(Outcome, " only", " Only Succeeds") %>%
      str_replace("Succeeded", "Succeed ") %>%
      str_replace("Failed", "Fail ")
  ) %>%
  select(Outcome, Comparison, Value) %>%
  pivot_wider(names_from = Comparison, values_from = Value)

total_systems_gprd <- final_table_data %>%
  # Filter out rows that do not have a standard count (e.g., 'Missing Level' with '0 (NA)')
  filter(!grepl("NA", `OTGPD_v_GPDimer`)) %>%
  # Extract the count part of the string (before the first space)
  mutate(Count = as.numeric(sub("\\s.*", "", `OTGPD_v_GPDimer`))) %>%
  # Sum the counts
  summarise(Total = sum(Count, na.rm = TRUE)) %>%
  pull(Total)

knitr::kable(final_table_data, format = "org", caption = paste(total_systems_gprd, "systems across", plot_df %>% select(num_fragments) %>% max(), "fragments, > 240 minutes is a failure"))
#+end_src

#+RESULTS[f58bdf29a06b4e7e2072d5bde5def9ff6a9e349d]:
:results:
#+CAPTION: 238 systems across 2 fragments, > 240 minutes is a failure

|Outcome               |OTGPD_v_GPDimer |OTGPD_v_Dimer |
|<l>                   |<l>             |<l>           |
|----------------------+----------------+--------------|
|Both Fail            |2 (0.8%)        |1 (0.4%)      |
|OTGPD Only Succeeds   |11 (4.6%)       |9 (3.8%)      |
|Both Succeed         |222 (93.3%)     |224 (94.1%)   |
|GPDimer Only Succeeds |3 (1.3%)        |NA            |
|Missing Level         |0 (NA)          |0 (NA)        |
|Dimer Only Succeeds   |NA              |4 (1.7%)      |
:end:

*** II: Saddle Quality

Together with the equality view:

#+begin_src R :results drawer replace
agg_png("method_quality_plot.png", width = 360, height = 240, units = "mm", res = 300)
plot_df <- dfff %>%
  filter(num_fragments < 3)

results <- generate_saddle_comparison_plot(
  df = plot_df,
  primary_method = "OTGPD",
  competitor_methods = c("GPDimer", "Dimer"),
  tolerance = 0.01,
  value_col = "barrier",
  system_id_col = "system_id"
)

plot_agreement <- generate_agreement_plot_with_n(results$summary_df) + theme_Publication() +
  theme(
    axis.text.y = element_blank(),
    axis.ticks.y = element_blank(),
    axis.title.y = element_blank(),
  )
plot_disagreement <- generate_diverging_disagreement_plot(
  summary_df = results$summary_df,
  primary_method = "OTGPD",
) + theme_Publication()

final_plot <- plot_agreement / plot_disagreement +
  plot_annotation(
    title = "OTGPD Performance: High Agreement with Dimer and Superiority in Disagreements",
    tag_levels = "A"
  ) &
  theme(
    plot.title = element_blank(),
    plot.subtitle = element_blank(),
    legend.direction = "horizontal",
    legend.position = "top",
    axis.text.y = element_blank(),
    axis.ticks.y = element_blank(),
    axis.title.y = element_blank()
  )

print(final_plot)
dev.off()


if (nrow(results$summary_df) > 0) {
  caption_table <- results$summary_df %>%
    mutate(
      # Format the value string with count and percentage
      Value = paste0(n, " (", sprintf("%.1f%%", percentage), ")")
    ) %>%
    # Select only the columns needed for the final table
    select(outcome, comparison_pair, Value) %>%
    # Pivot to the wide format you need for the caption
    pivot_wider(names_from = comparison_pair, values_from = Value, values_fill = "0 (0.0%)")

  # Print the resulting table
  knitr::kable(caption_table, format = "org")
}
#+end_src

#+RESULTS[3bc072545ef67d5ad74e42e0a2aaebbb59b88a3b]:
:results:
| outcome | OTGPD vs GPDimer | OTGPD vs Dimer |
| <l>     | <l>              | <l>            |
|---------+------------------+----------------|
| Equal   | 171 (75.7%)      | 201 (89.7%)    |
| GPDimer | 26 (11.5%)       | 0 (0.0%)       |
| OTGPD   | 29 (12.8%)       | 11 (4.9%)      |
| Dimer   | 0 (0.0%)         | 12 (5.4%)      |
:end:

*** III: Performance metrics
#+begin_src R :results drawer replace
plot_data <- dfff %>% filter(num_fragments < 3)
## agg_png("method_performance_plot.png", width = 720, height = 240, units = "mm", res = 300)
perf_plot <- create_performance_profile(
  df = plot_data,
  problem_cols = c("mol_id", "spin"),
  method_col = method,
  metric_col = tot_time,
  success_col = success,
  log_scale = TRUE,
  metric_name = "Time",
  title = "Time Performance Profile"
)

# The win_rate is a percentage, so divide by 100 to get the proportion
start_points <- perf_plot$caption_data$win_rate / 100

# Combine 0%, 100%, and the unique, sorted start points for the y-axis
custom_breaks <- sort(unique(c(0, start_points, 1.0)))

p1 <- perf_plot[[1]] + theme_Publication() +
  labs(
    x = expression("Time / Shortest Time" * " (" * log[2] * " scale)"),
    ## y = expression(P(r[p*","*s] <= tau))
  ) +
  scale_y_continuous(
    labels = scales::number_format(accuracy = 0.01), # 0 to 1 scale
    breaks = custom_breaks,
    expand = expansion(mult = c(0.01, 0.01))
  ) +
  theme(
    plot.title = element_blank(),
    legend.position = "inside",
    ## offsets are x-,y- from bottom left, 0 to 1
    axis.title.y = element_text(face = "bold", vjust = -10),
    legend.position.inside = c(0.8, 0.2),
    panel.spacing = unit(0.5, "lines")
  ) + scale_color_Publication()


# Data for the PES Calls plot
data_pes <- plot_data %>%
  filter(success == TRUE) %>%
  select(method, pes_calls)

p_pes_clean <- ggplot(data_pes, aes(x = pes_calls, y = method, fill = method)) +
  geom_violin(
    alpha = 0.6,
    trim = TRUE,
    show.legend = FALSE,
    color = NA
  ) +
  ## geom_density_ridges()+
  geom_boxplot(
    width = 0.15,
    alpha = 0.9,
    show.legend = FALSE,
    color = "black" # Use black border for clean separation
  ) +
  geom_point(
    position = position_jitter(height = 0.1, width = 0),
    size = 1.5,
    alpha = 0.1, # Keep them very light to not overpower the violin/box
    show.legend = FALSE
  ) +

  # Log10 scale for X-axis (PES Calls)
  scale_x_log10() +

  # Apply theme and colors
  theme_Publication() +
  scale_fill_Publication() +

  # Clean, academic labels
  labs(
    x = expression("HF Calcs. (" * log[10] * " scale)"),
    y = NULL
  ) +
  theme(
    legend.position = "none",
    plot.title = element_blank(),
    axis.title.x = element_text(face = "bold", margin = margin(t = 10)),
    axis.text.y = element_text(face = "bold"),
  )


pall <- (p1 / p_pes_clean) + plot_layout(heights = c(2, 1)) + plot_annotation(tag_levels = "A")
## ggsave("full_datperf.png", pall, width = 47.4, height = 20, units="cm")
ggsave("full_datperf.png", pall, width = 20, height = 10)
## dev.off
formatted_table <- perf_plot$caption_data %>%
  # Arrange by a key performance metric, like win_rate, for a logical order
  arrange(desc(win_rate)) %>%
  # Select the most important columns and give them publication-ready names
  transmute(
    Method = method,
    `Total Systems` = n_total,
    `Successfully Solved` = n_solvable,
    `Win Rate (%)` = round(win_rate, 1),
    `Median ` = round(median_tau, 2),
    ` for 90% Solved` = round(tau_at_90_percent, 2)
  )

# Generate the kable table, which you can print directly into your document
knitr::kable(
  formatted_table,
  format = "org",
  caption = "Summary of performance profile metrics. 'Win Rate' is the percentage of systems for which a method was fastest. '' (tau) is the performance ratio (Time / Best Time)."
)
#+end_src

#+RESULTS[50e198e4f6361d48579b0cc158e57be15d92ee7b]:
:results:
#+CAPTION: Summary of performance profile metrics. 'Win Rate' is the percentage of systems for which a method was fastest. '' (tau) is the performance ratio (Time / Best Time).

|Method  | Total Systems| Successfully Solved| Win Rate (%)| Median |  for 90% Solved|
|<l>     |           <r>|                 <r>|          <r>|      <r>|              <r>|
|--------+--------------+--------------------+-------------+---------+-----------------|
|OTGPD   |           238|                 233|         70.6|     1.00|             1.00|
|GPDimer |           238|                 230|         20.6|     1.39|             1.01|
|Dimer   |           238|                 229|          8.8|     2.65|             1.01|
:end:

The metric upon the best value of the metric we define here as .

Also of interest.

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
data_pes %>% group_by(method) %>% summarise(n=n(),mpes=mean(pes_calls), medpes=median(pes_calls), minpes=min(pes_calls), max=max(pes_calls))
#+end_src

#+RESULTS[31d0f4e4343f653a1c20e7b23001c064d83904d7]:
| method  |   n |  mpes | medpes | minpes |  max |
|---------+-----+-------+--------+--------+------|
| Dimer   | 229 | 309.1 |    254 |     42 | 2666 |
| GPDimer | 230 |  32.4 |     30 |     15 |  112 |
| OTGPD   | 233 |  29.0 |     28 |     14 |   92 |

With

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
plot_data %>% filter(success==TRUE) %>% group_by(method) %>% summarise(n=n(),mtime=mean(tot_time), medtime=median(tot_time), mintime=min(tot_time), max=max(tot_time))
#+end_src

#+RESULTS[2901b3aa988afe0a601b261b56dba7fc24ee332e]:
| method  |   n | mtime | medtime | mintime |   max |
|---------+-----+-------+---------+---------+-------|
| Dimer   | 229 |  23.7 |    18.8 |     3.0 | 255.4 |
| GPDimer | 230 |  28.3 |     9.9 |     1.5 | 637.0 |
| OTGPD   | 233 |  12.6 |     7.3 |     0.5 | 111.4 |

**** IA: D110

Basically a single plot on the efficiency:

Or as a two panel set.

#+begin_src R
pdat <- sdff %>% filter(system_id=='d_110')
p1 <- plot_hyperparameters_srun(pdat) +
 facet_wrap(~method, scales="free", ncol=2) +
  labs(
    title = NULL,
    axis.title.y = NULL,
  ) +
  theme_Publication() +
  theme(
    title = element_blank(),
    legend.title = element_blank(),
    legend.position = "top",
    legend.direction = "horizontal",
    legend.position.inside = c(0.75, 0.9),
  )
ggsave("d110_hypopt.png", p1, width = 8, height = 6)
#+end_src

#+RESULTS[c7cb2a0485cc0fb3ce55eab61aea88deb39fee2f]:
: d110_hypopt.png


***** Caption
#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
dfff %>% filter(system_id=="d_110") %>% select(system_id, method, tot_time, pes_calls)
#+end_src

#+RESULTS[7c5fdd7190175d6ebac5aee2f0022cfcb34845eb]:
| system_id | method  | tot_time | pes_calls |
|-----------+---------+----------+-----------|
| d_110     | Dimer   |      8.5 |       104 |
| d_110     | GPDimer |          |           |
| d_110     | OTGPD   |      5.2 |        23 |

***** Caption
#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
find_matching_saddles_all(dfff, "method", levels(dfff$method)) %>% filter(num_fragments < 3) %>%
  filter(method %in% c("GPDimer", "OTGPD")) %>%
  select(system_id, method, tot_time) %>%
  pivot_wider(
    names_from = method,
    values_from = tot_time
  ) %>%
  mutate(
    time_gap = abs(GPDimer - OTGPD)
  ) %>%
  drop_na(time_gap) %>%
  arrange(desc(time_gap)) %>%
  filter(system_id=="d_136")
  ## head(15)
#+end_src

#+RESULTS[2b2715bbd13f19eecf5485195f8401bc9fdcfdc8]:
| system_id | GPDimer | OTGPD | time_gap |
|-----------+---------+-------+----------|
| d_136     |    45.8 |  19.9 |     25.8 |

Where we calculate HOD activation with:
#+begin_src bash :eval never
ag --ignore "sync_results" -z "increasing" 2>/dev/null | awk '/\.log\.gz/ { split($0, a, "/"); printf "%s_%d\n", substr(a[1], 1, 1), a[2] + 0; }' | sort -u
#+end_src

Also.

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
dfff %>%  filter(method %in% c("GPDimer", "OTGPD"), system_id=="d_136") %>%
  select(system_id, method, tot_time, pes_calls)
#+end_src

#+RESULTS[57f2fcb1c3c904de8c4dad29931ae6cccc0c7818]:
| system_id | method  | tot_time | pes_calls |
|-----------+---------+----------+-----------|
| d_136     | GPDimer |     45.8 |        39 |
| d_136     | OTGPD   |     19.9 |        28 |

Finally:

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
total_cost_metrics <- sdff %>%
  filter(system_id == "d_136", method %in% c("GPDimer", "OTGPD")) %>%
  group_by(system_id, method) %>%
  summarise(
    Total_Func_Calls = sum(func_count),
    Total_Optimization_Time_s = sum(optimize_time),
    Number_of_Iterations = n(),
    .groups = 'drop'
  ) %>%
  mutate(
    Avg_Time_Per_Iter_s = Total_Optimization_Time_s / Number_of_Iterations,
    Avg_Func_Per_Iter = Total_Func_Calls / Number_of_Iterations,
    Time_Per_Func_Call_s = Total_Optimization_Time_s / Total_Func_Calls
  )

print(total_cost_metrics)
#+end_src

#+RESULTS[0fc1956afcc8e0047ed8920ad680c69192e76529]:
| system_id | method  | Total_Func_Calls | Total_Optimization_Time_s | Number_of_Iterations | Avg_Time_Per_Iter_s | Avg_Func_Per_Iter | Time_Per_Func_Call_s |
|-----------+---------+------------------+---------------------------+----------------------+---------------------+-------------------+----------------------|
| d_136     | GPDimer |              403 |                    2235.2 |                   34 |                65.7 |              11.9 |                  5.5 |
| d_136     | OTGPD   |             3974 |                    8527.0 |                  279 |                30.6 |              14.2 |                  2.1 |

